package Lesson_5

const val USER_NAME = "Zaphod"
const val USER_PASSWOR = "PanGalactic"

fun main() {
    print(
        "\"Внимание, пассажир. Моя обязанность, как обычно, незавидная, - приветствовать вас на борту корабля" +
                " \"Heart of Gold\". [вздыхает...] \nЧто ж, введи, пожалуйста, свое имя пользователя, чтобы" +
                " мы могли приступить к процессу входа. Я всегда готов служить, хотя это не \nприносит мне" +
                " радости... но вы, наверное, об этом не заботитесь. [вздыхает ещё глубже...] Да, вперед," +
                " пожалуйста, вводите свои данные...\"\n\nВведите имя пользователя: "
    )
    val enteringName = readln()

    if (enteringName != USER_NAME) {
        println("\nПользователь не найден! Пожалуйста, пройдите регистрацию")
        return
    }

    if (enteringName == USER_NAME) {
        print("\nВведите пароль пользователя: ")
        val enteringPassword = readln()
        if (enteringPassword == USER_PASSWOR) print(
            "\n\"[вздыхает...] Ваши данные проверены, и о, чудо, они верны... Пользователь \"Zaphod\", вам разрешено" +
                    " входить на борт корабля \"Heart of Gold\". \nХотя мне всё равно... Ну вперед, войдите... Если" +
                    " вам так уж надо, в конце концов... [меланхолический вздох...] Надеюсь, вам понравится" +
                    " \nпребывание здесь больше, чем мне.\""
        )
        else print("\nНеверный пароль")
    }
}